
tree = [
    ['печеный', 'табак для трубки'],

    ['печеный', 'горелый', 'едкий'],
    ['печеный', 'горелый', 'дымный'],
    ['печеный', 'горелый', 'пепельный'],
    ['печеный', 'горелый', 'поджаренный'],

    ['печеный', 'злаки', 'зерновой'],
    ['печеный', 'злаки', 'солод'],

    ['печеный', 'табак', 'табачный лист'],

    ['печеный', 'молочное печенье'],


    ['пряный', 'пикантный'],

    ['пряный', 'коричневые пряности', 'анис'],
    ['пряный', 'коричневые пряности', 'корица'],
    ['пряный', 'коричневые пряности', 'мускат'],
    ['пряный', 'коричневые пряности', 'гвоздика'],

    ['пряный', 'перец'],

    ['пряный', 'специи'],


    ['ореховый/какао', 'ореховый', 'жареные орехи'],
    ['ореховый/какао', 'ореховый', 'орех макадамия'],
    ['ореховый/какао', 'ореховый', 'фундук'],
    ['ореховый/какао', 'ореховый', 'мускатный орех'],
    ['ореховый/какао', 'ореховый', 'арахисовое пралине'],
    ['ореховый/какао', 'ореховый', 'арахис'],
    ['ореховый/какао', 'ореховый', 'грецкий орех'],
    ['ореховый/какао', 'ореховый', 'миндаль'],
    ['ореховый/какао', 'ореховый', 'какао'],

    ['ореховый/какао', 'какао', 'шоколад'],
    ['ореховый/какао', 'какао', 'шоколадный трюфель'],
    ['ореховый/какао', 'какао', 'горький шоколад'],
    ['ореховый/какао', 'какао', 'темный шоколад'],
    ['ореховый/какао', 'какао', 'молочный шоколад'],

    ['сладкий', 'ваниль'],

    ['сладкий', 'ванилин'],

    ['сладкий', 'сахар мусковадо'],

    ['сладкий', 'тростниковый/коричневый сахар', 'мёд'],
    ['сладкий', 'тростниковый/коричневый сахар', 'кленовый сироп'],
    ['сладкий', 'тростниковый/коричневый сахар', 'сливочная карамель'],
    ['сладкий', 'тростниковый/коричневый сахар', 'меласа'],
    ['сладкий', 'тростниковый/коричневый сахар', 'соленая карамель'],
    ['сладкий', 'тростниковый/коричневый сахар', 'карамель'],
    ['сладкий', 'тростниковый/коричневый сахар', 'тростниковый сахар'],

    ['сладкий', 'сладкий запах'],

    ['сладкий', 'в целом сладкий', 'варенье',  'брусничное варенье'],
    ['сладкий', 'в целом сладкий', 'варенье', 'апельсиновое варенье'],
    ['сладкий', 'в целом сладкий', 'варенье', 'варенье из черешни'],

    ['сладкий', 'в целом сладкий', 'черри-кола'],

    ['сладкий', 'в целом сладкий', 'арбузный сок'],


    ['цветочный', 'чёрный чай'],

    ['цветочный', 'цветочный', 'жасмин'],
    ['цветочный', 'цветочный', 'ромашка'],
    ['цветочный', 'цветочный', 'лаванда'],
    ['цветочный', 'цветочный', 'лемонграсс'],
    ['цветочный', 'цветочный', 'роза'],
    ['цветочный', 'цветочный', 'фиалка'],
    ['цветочный', 'цветочный', 'гибискус'],
    ['цветочный', 'цветочный', 'бергамот'],


    ['фруктовый', 'ягоды', 'красная смородина'],
    ['фруктовый', 'ягоды', 'кизил'],
    ['фруктовый', 'ягоды', 'крыжовник'],
    ['фруктовый', 'ягоды', 'арбуз'],
    ['фруктовый', 'ягоды', 'черная смородина'],
    ['фруктовый', 'ягоды', 'земляника'],
    ['фруктовый', 'ягоды', 'черника'],
    ['фруктовый', 'ягоды', 'белая черешня'],
    ['фруктовый', 'ягоды', 'клубника'],
    ['фруктовый', 'ягоды', 'яжевика'],
    ['фруктовый', 'ягоды', 'малина'],

    ['фруктовый', 'другие фрукты', 'кокос'],
    ['фруктовый', 'другие фрукты', 'вишня'],
    ['фруктовый', 'другие фрукты', 'личи'],
    ['фруктовый', 'другие фрукты', 'желтая слива'],
    ['фруктовый', 'другие фрукты', 'гранат'],
    ['фруктовый', 'другие фрукты', 'ананас'],
    ['фруктовый', 'другие фрукты', 'слива'],
    ['фруктовый', 'другие фрукты', 'виноград'],
    ['фруктовый', 'другие фрукты', 'белый виноград'],
    ['фруктовый', 'другие фрукты', 'тёмный виноград'],
    ['фруктовый', 'другие фрукты', 'красный виноград'],
    ['фруктовый', 'другие фрукты', 'персик'],
    ['фруктовый', 'другие фрукты', 'абрикос'],
    ['фруктовый', 'другие фрукты', 'карамбола'],
    ['фруктовый', 'другие фрукты', 'груша'],
    ['фруктовый', 'другие фрукты', 'китайская груша'],
    ['фруктовый', 'другие фрукты', 'яблоко'],
    ['фруктовый', 'другие фрукты', 'красное яблоко'],
    ['фруктовый', 'другие фрукты', 'желтое яблоко'],
    ['фруктовый', 'другие фрукты', 'зелёное яблоко'],

    ['фруктовый', 'цитрусовые', 'кумкват'],
    ['фруктовый', 'цитрусовые', 'мандарин'],
    ['фруктовый', 'цитрусовые', 'лимон'],
    ['фруктовый', 'цитрусовые', 'лайм'],
    ['фруктовый', 'цитрусовые', 'грейпфрут'],
    ['фруктовый', 'цитрусовые', 'апельсин'],
    ['фруктовый', 'цитрусовые', 'красный апельсин'],
    ['фруктовый', 'цитрусовые', 'помело'],

    ['фруктовый', 'сухофрукты', 'вяленый банан'],
    ['фруктовый', 'сухофрукты', 'чернослив в шоколаде'],
    ['фруктовый', 'сухофрукты', 'курага'],
    ['фруктовый', 'сухофрукты', 'изюм'],
    ['фруктовый', 'сухофрукты', 'чернослив'],
    ['фруктовый', 'сухофрукты', 'желтый изюм'],


    ['кислый', 'ксилый', 'лимонная кислота'],
    ['кислый', 'ксилый', 'яблочная кислота'],
    ['кислый', 'ксилый', 'маслянная кислота'],
    ['кислый', 'ксилый', 'изовалериановая кислота'],
    ['кислый', 'ксилый', 'кислый запах'],
    ['кислый', 'ксилый', 'уксусная кислота'],

    ['кислый', 'алкоголь', 'клубничный ликёр'],
    ['кислый', 'алкоголь', 'бейлиз'],
    ['кислый', 'алкоголь', 'яблочный сидр'],
    ['кислый', 'алкоголь', 'забродивший'],
    ['кислый', 'алкоголь', 'перезрелый'],
    ['кислый', 'алкоголь', 'вино'],
    ['кислый', 'алкоголь', 'виски'],


    ['растительный', 'оливковое масло'],

    ['растительный', 'зелень', 'пряные травы'],
    ['растительный', 'зелень', 'растительный'],
    ['растительный', 'зелень', 'сено'],
    ['растительный', 'зелень', 'свежий'],
    ['растительный', 'зелень', 'темная зелень'],
    ['растительный', 'зелень', 'незрелый'],
    ['растительный', 'зелень', 'стручковый горох'],

    ['растительный', 'сырые продукты', 'зеленые овощи'],

    ['растительный', 'бобовый'],


    ['другие', 'бумажный/затхлый', 'картонный'],
    ['другие', 'бумажный/затхлый', 'затхлый'],
    ['другие', 'бумажный/затхлый', 'древесный'],
    ['другие', 'бумажный/затхлый', 'бумажный'],
    ['другие', 'бумажный/затхлый', 'затхлый/пыльный'],
    ['другие', 'бумажный/затхлый', 'затхлый/сырой'],
    ['другие', 'бумажный/затхлый', 'животный'],
    ['другие', 'бумажный/затхлый', 'затхлый/земельный'],
    ['другие', 'бумажный/затхлый', 'фенольный'],
    ['другие', 'бумажный/затхлый', 'мясной/бульонный'],

    ['другие', 'химический', 'соленый'],
    ['другие', 'химический', 'горький'],
    ['другие', 'химический', 'нефтяной'],
    ['другие', 'химический', 'медицинский'],
    ['другие', 'химический', 'резина'],
    ['другие', 'химический', 'латекс'],
]